backend/app/jobs/cleanup_expired_tokens_job.rb

DELETE FROM "refresh_tokens" WHERE "refresh_tokens"."expires_at" < '2026-06-09 22:00:17.257838'
---
    def perform
        RefreshToken.where(expires_at: ...30.days.ago).delete_all