backend/app/interactors/auth/login.rb

        def issue_tokens!(user)
            access_token, payload = JwtService.encode(user)
            raw_refresh, refresh_record = RefreshToken.issue!(
                user: user,
                remember_me: !remember_me.nil?,
                device_name: device_name,
                ip_address: ip_address,
                user_agent: user_agent
            )

            DeviceSession.create!(
                user: user,
                refresh_token: refresh_record,
                school_id: user.school_id,
                device_name: device_name,
                ip_address: ip_address,
                last_active_at: Time.current
            )
---
INSERT INTO "device_sessions" ("user_id", "refresh_token_id", "school_id", "device_name", "ip_address", "last_active_at", "created_at", "updated_at") VALUES ('4a865d00-6d50-4216-bb1c-07c0a8e346be', '4b7b44d3-1ea0-4252-be9d-534e30c679a5', '864de0a0-cab2-4a9b-9650-9c3b2da0c9bc', 'Chrome on macOS', '151.101.128.223/32', '2026-07-09 21:19:44.017563', '2026-07-09 21:19:44.030405', '2026-07-09 21:19:44.030405') RETURNING "id"

        def track_sign_in(user)
            user.update_columns(
                sign_in_count: user.sign_in_count + 1,
                last_sign_in_at: user.current_sign_in_at || Time.current,
                current_sign_in_at: Time.current,
                last_sign_in_ip: user.current_sign_in_ip,
                current_sign_in_ip: ip_address
            )
---
UPDATE "users" SET "sign_in_count" = 1, "last_sign_in_at" = '2026-07-09 21:19:44.038929', "current_sign_in_at" = '2026-07-09 21:19:44.038953', "last_sign_in_ip" = NULL, "current_sign_in_ip" = '151.101.128.223' WHERE "users"."id" = '4a865d00-6d50-4216-bb1c-07c0a8e346be'