backend/app/interactors/auth/refresh.rb

        def handle_reuse!(record)
            if record.revoked_at.present?
                record.user.refresh_tokens.active.find_each(&:revoke!)
---
SELECT "refresh_tokens".* FROM "refresh_tokens" WHERE "refresh_tokens"."user_id" = '4a865d00-6d50-4216-bb1c-07c0a8e346be' AND "refresh_tokens"."revoked_at" IS NULL AND (expires_at > '2026-07-09 22:53:39.791936') ORDER BY "refresh_tokens"."id" ASC LIMIT 1000
SELECT "users".* FROM "users" WHERE "users"."id" = '4a865d00-6d50-4216-bb1c-07c0a8e346be' LIMIT 1

        def migrate_device_session(old_record, new_record)
            session = old_record.device_session
            return if session.nil?

            session.update!(refresh_token: new_record, last_active_at: Time.current)
---
UPDATE "device_sessions" SET "refresh_token_id" = '65b5acb3-82c8-445b-9b1e-cb62763fdea6', "last_active_at" = '2026-07-09 21:21:25.281949', "updated_at" = '2026-07-09 21:21:25.284193' WHERE "device_sessions"."id" = '85f9eff3-119d-4679-9e9c-a4315b3ac8b9'