backend/app/controllers/api/v1/auth_controller.rb

            def revoke_session
                session = current_user.device_sessions.find(params.expect(:id))
---
SELECT "device_sessions".* FROM "device_sessions" WHERE "device_sessions"."user_id" = '4a865d00-6d50-4216-bb1c-07c0a8e346be' AND "device_sessions"."id" = '85f9eff3-119d-4679-9e9c-a4315b3ac8b9' LIMIT 1