backend/app/controllers/api/v1/base_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = '5a0c5788-cad1-46d4-ae36-007a447ca589'
---
            def authenticate_request!
                token = bearer_token
                return render_unauthorized("Missing access token") if token.blank?

                payload = JwtService.decode(token)
                return render_unauthorized("Invalid or expired token") if payload.nil?
                return render_unauthorized("Token has been revoked") if JwtDenylist.revoked?(payload["jti"])

                @current_user = User.kept.find_by(id: payload["sub"])