backend/app/controllers/api/v1/parents_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" IN ('5a0c5788-cad1-46d4-ae36-007a447ca589', '61b683d0-738d-4905-a96c-46799961c1b1', '08a1cd5b-257c-4ca0-8d9e-85a8461bf742', '55435649-0ac3-42e2-947e-77c44c1eef35', 'c296800a-81c9-4a4d-b20d-12cecafa2484', 'ab340259-408b-4c51-a058-cd5caf55482c', '6dd06a80-624b-4857-841d-f6292385ac08', '88979bda-2583-4865-99d0-4f2d663bee50', 'd81f8bb3-d743-4b8f-b1c9-6b4f1ccc3cc1', '2a99012e-1748-437b-86e0-1699b286c331')
---
            def index
                @parents = paginate(policy_scope(Parent).kept.includes(:user).order(:created_at))

SELECT "users".* FROM "users" WHERE "users"."id" = '05a5d18a-be12-4b8e-ba33-0f62f644ce73'
---
            def children
                @parent = policy_scope(Parent).kept.find(params.expect(:id))
                authorize @parent, :children?
                @students = @parent.students.kept.includes(:user)