backend/app/controllers/api/v1/students_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" IN ('05a5d18a-be12-4b8e-ba33-0f62f644ce73', '4468f612-a3ca-4ca6-9e54-cc13aa129879', 'd62571ef-c31b-4bcc-b544-0d7c29efd91b', 'cfadca47-52b5-4207-b86b-9a8366bd381c', '4d847ad0-6a2b-4dd7-9d52-1b05e56633d1', '02b1bee0-e061-4bc7-8a52-6da698ca7165', 'e26ea0de-ceb7-40d0-92c9-88e005c9a3ad', '806672ee-70d6-4361-afdc-f3106f817802', '6a5903d2-23fc-4ece-b58e-6ca337d3afec', 'db777834-5013-47ac-9f1b-c1d7e5d41941', 'df3900b0-848f-45fb-9fcf-81e37e560c56', '96d91cd6-fe1c-4a5e-8a04-2e34ca3d06db', '41f0a923-7771-4b1b-b1c9-750edcabc75e', '8d994ea7-1976-4d58-bf5a-ca135501f9a8', '18a843f3-03f1-4d1d-b1fe-f7283b60c1ef')
---
                scope = policy_scope(Student).kept.includes(:user)