backend/app/controllers/api/v1/teachers_controller.rb

                scope = policy_scope(Teacher).kept.includes(:user, :department)
---
SELECT "users".* FROM "users" WHERE "users"."id" IN ('2da9c1ee-8524-460e-bfc7-e6b3b3a3593c', 'c33a00b3-e1e8-4200-8c2f-6a161cb1f3d2', '3f087506-bd8c-478c-bedc-73861eb17dc7', '82150fa9-8d80-47e2-b5e2-8b64574449a8')